Here is the plan output, there is no policies whatsoever:

```
[vscode@50b1525e21de caf]$ rover -lz /tf/caf/landingzones/landingzone_caf_foundations -a plan -env sandbox

  /$$$$$$   /$$$$$$  /$$$$$$$$       /$$$$$$$                                        
 /$$__  $$ /$$__  $$| $$_____/      | $$__  $$                                       
| $$  \__/| $$  \ $$| $$            | $$  \ $$  /$$$$$$  /$$    /$$/$$$$$$   /$$$$$$ 
| $$      | $$$$$$$$| $$$$$         | $$$$$$$/ /$$__  $$|  $$  /$$/$$__  $$ /$$__  $$
| $$      | $$__  $$| $$__/         | $$__  $$| $$  \ $$ \  $$/$$/ $$$$$$$$| $$  \__/
| $$    $$| $$  | $$| $$            | $$  \ $$| $$  | $$  \  $$$/| $$_____/| $$      
|  $$$$$$/| $$  | $$| $$            | $$  | $$|  $$$$$$/   \  $/ |  $$$$$$$| $$      
 \______/ |__/  |__/|__/            |__/  |__/ \______/     \_/   \_______/|__/      
                                                                                     
                                                                                                                                                           
              version: aztfmod/rover:2009.0210


mode                          : 'landingzone'
terraform command output file : ''
tf_action                     : 'plan'
command and parameters        : ''
level (current)               : 'level0'
environment                   : 'sandbox'
workspace                     : 'sandpit'
tfstate                       : 'landingzone_caf_foundations.tfstate'

@calling process_actions
@calling verify_azure_session
Checking existing Azure session
@calling verify_parameters
landingzone                   : '/tf/caf/landingzones/landingzone_caf_foundations'
@calling get_storage_id

launchpad_light already installed

@calling deploy_from_remote_state
Connecting to the launchpad
@calling_get_logged_user_object_id
 - logged in objectId: 0384a397-5559-4458-923b-1cf9befa8301 (ypei003@UoA.auckland.ac.nz)
Initializing state with user: ypei003@UoA.auckland.ac.nz
@calling login_as_launchpad
 - keyvault_name: kv-launchpad-pdnshw3bk4u
 - Name: caf-launchpad-level0

Getting launchpad coordinates:
 - storage_account_name: zmwjstlevel0oqtu0gcimgdg
 - resource_group: zmwj-rg-launchpad-tfstates-xfp5jujjtuIqh
 - container: level0
 - tfstate file: launchpad.tfstate
 - subscription id: 27e4d366-b66d-448e-95af-4fa6cb794590
 - launchpad mode: launchpad_light
@calling deploy_landingzone
Deploying '/tf/caf/landingzones/landingzone_caf_foundations'
Upgrading modules...
- foundations_accounting in foundations_accounting
Downloading github.com/aztfmod/terraform-azurerm-caf-activity-logs?ref=vnext for foundations_accounting.activity_logs...
- foundations_accounting.activity_logs in /home/vscode/.terraform.cache/modules/foundations_accounting.activity_logs
Downloading github.com/aztfmod/terraform-azurerm-caf-diagnostics-logging?ref=vnext for foundations_accounting.diagnostics_logging...
- foundations_accounting.diagnostics_logging in /home/vscode/.terraform.cache/modules/foundations_accounting.diagnostics_logging
Downloading github.com/aztfmod/terraform-azurerm-caf-log-analytics?ref=vnext for foundations_accounting.log_analytics...
- foundations_accounting.log_analytics in /home/vscode/.terraform.cache/modules/foundations_accounting.log_analytics
- foundations_governance in foundations_governance
- foundations_governance.management_groups in foundations_governance/management_group
- foundations_security in foundations_security
Downloading github.com/aztfmod/terraform-azurerm-caf-security-center?ref=vnext for foundations_security.security_center...
- foundations_security.security_center in /home/vscode/.terraform.cache/modules/foundations_security.security_center
- foundations_security.sentinel in foundations_security/sentinel

Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of aztfmod/azurecaf...
- Finding hashicorp/azurerm versions matching "~> 2.25.0"...
- Using aztfmod/azurecaf v1.0.0 from the shared cache directory
- Using hashicorp/azurerm v2.25.0 from the shared cache directory

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* aztfmod/azurecaf: version = "~> 1.0.0"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Terraform init return code 0
calling plan
@calling plan
running terraform plan with 
 -TF_VAR_workspace: sandpit
 -state: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfstate
 -plan:  /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan
/tf/caf/landingzones/landingzone_caf_foundations
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.terraform_remote_state.launchpad: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_security["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["eastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["southeastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_security["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["southeastasia"].data.azurerm_client_config.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "eastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-hk"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "eastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "southeastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-sg"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "southeastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_security["eastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_security["southeastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan"

Releasing state lock. This may take a few moments...
Terraform plan return code: 0
[vscode@50b1525e21de caf]$ rover -lz /tf/caf/landingzones/landingzone_caf_foundations -a plan -env sandbox

  /$$$$$$   /$$$$$$  /$$$$$$$$       /$$$$$$$                                        
 /$$__  $$ /$$__  $$| $$_____/      | $$__  $$                                       
| $$  \__/| $$  \ $$| $$            | $$  \ $$  /$$$$$$  /$$    /$$/$$$$$$   /$$$$$$ 
| $$      | $$$$$$$$| $$$$$         | $$$$$$$/ /$$__  $$|  $$  /$$/$$__  $$ /$$__  $$
| $$      | $$__  $$| $$__/         | $$__  $$| $$  \ $$ \  $$/$$/ $$$$$$$$| $$  \__/
| $$    $$| $$  | $$| $$            | $$  \ $$| $$  | $$  \  $$$/| $$_____/| $$      
|  $$$$$$/| $$  | $$| $$            | $$  | $$|  $$$$$$/   \  $/ |  $$$$$$$| $$      
 \______/ |__/  |__/|__/            |__/  |__/ \______/     \_/   \_______/|__/      
                                                                                     
                                                                                                                                                           
              version: aztfmod/rover:2009.0210


mode                          : 'landingzone'
terraform command output file : ''
tf_action                     : 'plan'
command and parameters        : ''
level (current)               : 'level0'
environment                   : 'sandbox'
workspace                     : 'sandpit'
tfstate                       : 'landingzone_caf_foundations.tfstate'

@calling process_actions
@calling verify_azure_session
Checking existing Azure session
@calling verify_parameters
landingzone                   : '/tf/caf/landingzones/landingzone_caf_foundations'
@calling get_storage_id

launchpad_light already installed

@calling deploy_from_remote_state
Connecting to the launchpad
@calling_get_logged_user_object_id
 - logged in objectId: 0384a397-5559-4458-923b-1cf9befa8301 (ypei003@UoA.auckland.ac.nz)
Initializing state with user: ypei003@UoA.auckland.ac.nz
@calling login_as_launchpad
 - keyvault_name: kv-launchpad-pdnshw3bk4u
 - Name: caf-launchpad-level0

Getting launchpad coordinates:
 - storage_account_name: zmwjstlevel0oqtu0gcimgdg
 - resource_group: zmwj-rg-launchpad-tfstates-xfp5jujjtuIqh
 - container: level0
 - tfstate file: launchpad.tfstate
 - subscription id: 27e4d366-b66d-448e-95af-4fa6cb794590
 - launchpad mode: launchpad_light
@calling deploy_landingzone
Deploying '/tf/caf/landingzones/landingzone_caf_foundations'
Upgrading modules...
- foundations_accounting in foundations_accounting
Downloading github.com/aztfmod/terraform-azurerm-caf-activity-logs?ref=vnext for foundations_accounting.activity_logs...
- foundations_accounting.activity_logs in /home/vscode/.terraform.cache/modules/foundations_accounting.activity_logs
Downloading github.com/aztfmod/terraform-azurerm-caf-diagnostics-logging?ref=vnext for foundations_accounting.diagnostics_logging...
- foundations_accounting.diagnostics_logging in /home/vscode/.terraform.cache/modules/foundations_accounting.diagnostics_logging
Downloading github.com/aztfmod/terraform-azurerm-caf-log-analytics?ref=vnext for foundations_accounting.log_analytics...
- foundations_accounting.log_analytics in /home/vscode/.terraform.cache/modules/foundations_accounting.log_analytics
- foundations_governance in foundations_governance
- foundations_governance.management_groups in foundations_governance/management_group
- foundations_security in foundations_security
Downloading github.com/aztfmod/terraform-azurerm-caf-security-center?ref=vnext for foundations_security.security_center...
- foundations_security.security_center in /home/vscode/.terraform.cache/modules/foundations_security.security_center
- foundations_security.sentinel in foundations_security/sentinel

Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of aztfmod/azurecaf...
- Finding hashicorp/azurerm versions matching "~> 2.25.0"...
- Using aztfmod/azurecaf v1.0.0 from the shared cache directory
- Using hashicorp/azurerm v2.25.0 from the shared cache directory

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* aztfmod/azurecaf: version = "~> 1.0.0"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Terraform init return code 0
calling plan
@calling plan
running terraform plan with 
 -TF_VAR_workspace: sandpit
 -state: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfstate
 -plan:  /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan
/tf/caf/landingzones/landingzone_caf_foundations
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.terraform_remote_state.launchpad: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_security["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["eastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["southeastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_security["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["southeastasia"].data.azurerm_client_config.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "eastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-hk"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "eastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "southeastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-sg"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "southeastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_security["eastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_security["southeastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan"

Releasing state lock. This may take a few moments...
Terraform plan return code: 0[vscode@50b1525e21de caf]$ rover -lz /tf/caf/landingzones/landingzone_caf_foundations -a plan -env sandbox

  /$$$$$$   /$$$$$$  /$$$$$$$$       /$$$$$$$                                        
 /$$__  $$ /$$__  $$| $$_____/      | $$__  $$                                       
| $$  \__/| $$  \ $$| $$            | $$  \ $$  /$$$$$$  /$$    /$$/$$$$$$   /$$$$$$ 
| $$      | $$$$$$$$| $$$$$         | $$$$$$$/ /$$__  $$|  $$  /$$/$$__  $$ /$$__  $$
| $$      | $$__  $$| $$__/         | $$__  $$| $$  \ $$ \  $$/$$/ $$$$$$$$| $$  \__/
| $$    $$| $$  | $$| $$            | $$  \ $$| $$  | $$  \  $$$/| $$_____/| $$      
|  $$$$$$/| $$  | $$| $$            | $$  | $$|  $$$$$$/   \  $/ |  $$$$$$$| $$      
 \______/ |__/  |__/|__/            |__/  |__/ \______/     \_/   \_______/|__/      
                                                                                     
                                                                                                                                                           
              version: aztfmod/rover:2009.0210


mode                          : 'landingzone'
terraform command output file : ''
tf_action                     : 'plan'
command and parameters        : ''
level (current)               : 'level0'
environment                   : 'sandbox'
workspace                     : 'sandpit'
tfstate                       : 'landingzone_caf_foundations.tfstate'

@calling process_actions
@calling verify_azure_session
Checking existing Azure session
@calling verify_parameters
landingzone                   : '/tf/caf/landingzones/landingzone_caf_foundations'
@calling get_storage_id

launchpad_light already installed

@calling deploy_from_remote_state
Connecting to the launchpad
@calling_get_logged_user_object_id
 - logged in objectId: 0384a397-5559-4458-923b-1cf9befa8301 (ypei003@UoA.auckland.ac.nz)
Initializing state with user: ypei003@UoA.auckland.ac.nz
@calling login_as_launchpad
 - keyvault_name: kv-launchpad-pdnshw3bk4u
 - Name: caf-launchpad-level0

Getting launchpad coordinates:
 - storage_account_name: zmwjstlevel0oqtu0gcimgdg
 - resource_group: zmwj-rg-launchpad-tfstates-xfp5jujjtuIqh
 - container: level0
 - tfstate file: launchpad.tfstate
 - subscription id: 27e4d366-b66d-448e-95af-4fa6cb794590
 - launchpad mode: launchpad_light
@calling deploy_landingzone
Deploying '/tf/caf/landingzones/landingzone_caf_foundations'
Upgrading modules...
- foundations_accounting in foundations_accounting
Downloading github.com/aztfmod/terraform-azurerm-caf-activity-logs?ref=vnext for foundations_accounting.activity_logs...
- foundations_accounting.activity_logs in /home/vscode/.terraform.cache/modules/foundations_accounting.activity_logs
Downloading github.com/aztfmod/terraform-azurerm-caf-diagnostics-logging?ref=vnext for foundations_accounting.diagnostics_logging...
- foundations_accounting.diagnostics_logging in /home/vscode/.terraform.cache/modules/foundations_accounting.diagnostics_logging
Downloading github.com/aztfmod/terraform-azurerm-caf-log-analytics?ref=vnext for foundations_accounting.log_analytics...
- foundations_accounting.log_analytics in /home/vscode/.terraform.cache/modules/foundations_accounting.log_analytics
- foundations_governance in foundations_governance
- foundations_governance.management_groups in foundations_governance/management_group
- foundations_security in foundations_security
Downloading github.com/aztfmod/terraform-azurerm-caf-security-center?ref=vnext for foundations_security.security_center...
- foundations_security.security_center in /home/vscode/.terraform.cache/modules/foundations_security.security_center
- foundations_security.sentinel in foundations_security/sentinel

Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of aztfmod/azurecaf...
- Finding hashicorp/azurerm versions matching "~> 2.25.0"...
- Using aztfmod/azurecaf v1.0.0 from the shared cache directory
- Using hashicorp/azurerm v2.25.0 from the shared cache directory

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* aztfmod/azurecaf: version = "~> 1.0.0"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Terraform init return code 0
calling plan
@calling plan
running terraform plan with 
 -TF_VAR_workspace: sandpit
 -state: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfstate
 -plan:  /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan
/tf/caf/landingzones/landingzone_caf_foundations
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.terraform_remote_state.launchpad: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_security["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["eastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["eastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["eastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_governance["southeastasia"].data.azurerm_subscription.current: Refreshing state...
module.foundations_governance["southeastasia"].module.management_groups.data.azurerm_client_config.current: Refreshing state...
module.foundations_security["southeastasia"].data.azurerm_client_config.current: Refreshing state...
module.foundations_accounting["southeastasia"].data.azurerm_client_config.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-hk"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "eastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_coresec_name will be created
  + resource "azurecaf_naming_convention" "rg_coresec_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-core-sec-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurecaf_naming_convention.rg_operations_name will be created
  + resource "azurecaf_naming_convention" "rg_operations_name" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "hub-operations-sea"
      + prefix        = "zmwj"
      + resource_type = "rg"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_coresec will be created
  + resource "azurerm_resource_group" "rg_coresec" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["southeastasia"].azurerm_resource_group.rg_operations will be created
  + resource "azurerm_resource_group" "rg_operations" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "owner"          = "CAF"
        }
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "eastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-hk"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["eastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "eastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurecaf_naming_convention.caf_name_st will be created
  + resource "azurecaf_naming_convention" "caf_name_st" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "diaglogs"
      + prefix        = "zmwj"
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.diagnostics_logging.azurerm_storage_account.log will be created
  + resource "azurerm_storage_account" "log" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "southeastasia"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.diagnostics_logging"
          + "owner"          = "CAF"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurecaf_naming_convention.caf_name_la will be created
  + resource "azurecaf_naming_convention" "caf_name_la" {
      + convention    = "cafrandom"
      + id            = (known after apply)
      + name          = "caflalogs-sg"
      + prefix        = "zmwj"
      + resource_type = "azurerm_log_analytics_workspace"
      + result        = (known after apply)
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ADReplication"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ADReplication"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ADReplication"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["AgentHealthAssessment"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "AgentHealthAssessment"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/AgentHealthAssessment"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["ContainerInsights"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "ContainerInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["DnsAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "DnsAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/DnsAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["KeyVaultAnalytics"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "KeyVaultAnalytics"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/KeyVaultAnalytics"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_solution.la_solution["NetworkMonitoring"] will be created
  + resource "azurerm_log_analytics_solution" "la_solution" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "NetworkMonitoring"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/NetworkMonitoring"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_accounting["southeastasia"].module.log_analytics.azurerm_log_analytics_workspace.log_analytics will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics" {
      + id                   = (known after apply)
      + location             = "southeastasia"
      + name                 = (known after apply)
      + portal_url           = (known after apply)
      + primary_shared_key   = (sensitive value)
      + resource_group_name  = (known after apply)
      + retention_in_days    = 365
      + secondary_shared_key = (sensitive value)
      + sku                  = "PerGB2018"
      + tags                 = {
          + "BusinessUnit"   = "SHARED"
          + "DR"             = "NON-DR-ENABLED"
          + "blueprint"      = "foundations_accounting"
          + "costCenter"     = "1664"
          + "deploymentType" = "Terraform"
          + "environment"    = "sandbox"
          + "landingzone"    = "landingzone_caf_foundations"
          + "module"         = "foundations_accounting.log_analytics"
          + "owner"          = "CAF"
        }
      + workspace_id         = (known after apply)
    }

  # module.foundations_security["eastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "eastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

  # module.foundations_security["southeastasia"].module.sentinel[0].azurerm_log_analytics_solution.sentinel will be created
  + resource "azurerm_log_analytics_solution" "sentinel" {
      + id                    = (known after apply)
      + location              = "southeastasia"
      + resource_group_name   = (known after apply)
      + solution_name         = "SecurityInsights"
      + workspace_name        = (known after apply)
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityInsights"
          + publisher = "Microsoft"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/vscode/.terraform.cache/tfstates/sandpit/landingzone_caf_foundations.tfplan"

Releasing state lock. This may take a few moments...
Terraform plan return code: 0
```